**==================== Data Manipulation ====================**

In [1]:
import pandas as pd

In [2]:
data = {"Name": ["Alice", "Brilliant", "Charlie"],
        "Age": [20, 35, 18]}

df = pd.DataFrame(data)
df

        Name  Age
0      Alice   20
1  Brilliant   35
2    Charlie   18

In [3]:
df["City"] = ["New York", "Los Angeles", "Chicago"]
df

        Name  Age         City
0      Alice   20     New York
1  Brilliant   35  Los Angeles
2    Charlie   18      Chicago

In [4]:
df = df.drop("City", axis= 1)
df

        Name  Age
0      Alice   20
1  Brilliant   35
2    Charlie   18

**==================== Data Aggregation ====================**

In [5]:
data = {"Category": ["A", "B", "A", "B", "A", "B"],
        "Value": [10, 20, 15, 25, 30, 35]}

df = pd.DataFrame(data)
df

  Category  Value
0        A     10
1        B     20
2        A     15
3        B     25
4        A     30
5        B     35

In [6]:
df_1 = df.groupby("Category")

In [7]:
df_1["Value"].sum()

Category
A    55
B    80
Name: Value, dtype: int64

In [8]:
df_1["Value"].mean()

Category
A    18.333333
B    26.666667
Name: Value, dtype: float64

In [9]:
df_1["Value"].median()

Category
A    15.0
B    25.0
Name: Value, dtype: float64

In [10]:
df_1["Value"].max()

Category
A    30
B    35
Name: Value, dtype: int64

In [11]:
df_1["Value"].min()

Category
A    10
B    20
Name: Value, dtype: int64

In [12]:
df_1["Value"].count()

Category
A    3
B    3
Name: Value, dtype: int64

In [13]:
data = {"Category": ["A", "B", "A", "B", "A", "B"],
        "Value": [10, 20, 15, 25, 30, 35]}

df = pd.DataFrame(data)
df_1 = df.groupby("Category")
df_1["Value"].sum()

Category
A    55
B    80
Name: Value, dtype: int64

In [14]:
pivot_table = df.pivot_table(index= "Category", values= "Value", aggfunc= "sum")
pivot_table

          Value
Category
A            55
B            80

**==================== Basic DataFrame Operations ====================**

In [15]:
data = {"Name": ["Alice", "Brilliant", "Charlie"],
        "Age": [25, 30, 35],
        "City": ["New York", "Los Angeles", "Chicago"]}

df = pd.DataFrame(data)
df

        Name  Age         City
0      Alice   25     New York
1  Brilliant   30  Los Angeles
2    Charlie   35      Chicago

In [16]:
df["Name"]

0        Alice
1    Brilliant
2      Charlie
Name: Name, dtype: object

In [17]:
df[["Name", "Age"]]

        Name  Age
0      Alice   25
1  Brilliant   30
2    Charlie   35

In [18]:
df["Age"] > 30

0    False
1    False
2     True
Name: Age, dtype: bool

In [19]:
df[df["Age"] > 30]

      Name  Age     City
2  Charlie   35  Chicago

In [20]:
df[ (df["Age"] > 20) & (df["City"] == "New York") ]

    Name  Age      City
0  Alice   25  New York

In [21]:
df.sort_values(by= "Age")

        Name  Age         City
0      Alice   25     New York
1  Brilliant   30  Los Angeles
2    Charlie   35      Chicago

In [22]:
df.sort_values(by= ["City", "Age"], ascending= [True, False])

        Name  Age         City
2    Charlie   35      Chicago
1  Brilliant   30  Los Angeles
0      Alice   25     New York